class Temp {
	int i = 100;
	static void print(){ System.out.println( i ); }
	//// 에러가 나는 이유? 함수와 변수의 생성시점이 다르기 때문에 i를 이용하려고 보면 i가 아직 없기때문에 사용이 불가능!
}

public class Test043_static의_이해2 {
	public static void main( String[] args ) {
		Temp.print();
		// 스테틱 멤버는 클래스명.심볼 형태로 접근이 가능!
		// 인스턴스 생성전에 존재하기에 ..!
	}
}
/*	static 멤버는 클래스명.심볼 형태로 접근. ( 인스턴스 생성 전에 존재 )

	static 멤버 함수 안에서는 non-static 한 멤버함수 멤버변수에
		접근할 수 없다. ( 위의 i 의 경우 ) - 왜?
		
	// 지금까지 클래스의 데이터에 접근하려면 인스턴스를 생성하고 그것을 받는 참조형 변수로부터 접근할 수 있엇지만
		// static으로 클래스의 멤버 변수에 접근이 가능하게 한다. 인스턴스도 아직 만들어지지도 안았는데...
		// 인스턴스가 만들어지기 전에 static으로 선언된 변수들은 클래스가 올라올때 메모리가 생성된다.
		// 이 파일을 실행시키면 자바 VM이 돌아가면서 042가 먼저 올라가고 main을 먼저 실행되고 난후 Temp가 있어서 Temp클래스도 올리게
		// 되고 인스턴스가 생성되기 전에 먼저 static 변수가 메모리 위에 올라간다. 그래서 인스턴스 생성 없이 스테틱 변수를 사용할 수 있게
		// 된다.

		// 자바 실행환경은 클래스가 필요해지면 .class 파일을 메모리에 올리게된다. 그이후에 인스턴스 생성이 가능해진다.
		// 하지만 But 스테틱으로 선언된 멤버변수는 클래스가 로딩될때 메모리를 할당받는다.
		// 하지만 BUt 넌스테틱으로 선언된 변수는 인스턴스가 생성될 때 메모리가 할당된다.
		// 스테틱 변수는 인스턴스가 모두 공유하는 변수다. 유일한 변수다. 인스턴스가 몇개이건 간에 유일
		// 넌스테틱 변수는 인스턴스마다 따로 따로 존재.
*/